{
  "overview": "github-docker: 40 tools; add_comment_to_pending_review -\u003e Add review comment to the requester's latest pending pull request review., add_issue_comment -\u003e Add a comment to a specific issue in a GitHub repository., assign_copilot_to_issue -\u003e Assign Copilot to a specific issue in a GitHub repository.\n\nThis tool can help with the following..., create_branch -\u003e Create a new branch in a GitHub repository, create_or_update_file -\u003e Create or update a single file in a GitHub repository. If updating, you must provide the SHA of the file you want to update. Use this tool to create or update a file in a GitHub repository remotely, create_pull_request -\u003e Create a new pull request in a GitHub repository., create_repository -\u003e Create a new GitHub repository in your account or specified organization, delete_file -\u003e Delete a file from a GitHub repository, fork_repository -\u003e Fork a GitHub repository to your account or specified organization, get_commit -\u003e Get details for a commit from a GitHub repository, get_file_contents -\u003e Get the contents of a file or directory from a GitHub repository, get_label -\u003e Get a specific label from a repository., get_latest_release -\u003e Get the latest release in a GitHub repository, get_me -\u003e Get details of the authenticated GitHub user., get_release_by_tag -\u003e Get a specific release by its tag name in a GitHub repository, get_tag -\u003e Get details about a specific git tag in a GitHub repository, get_team_members -\u003e Get member usernames of a specific team in an organization., get_teams -\u003e Get details of the teams the user is a member of., issue_read -\u003e Get information about a specific issue in a GitHub repository., issue_write -\u003e Create a new or update an existing issue in a GitHub repository., list_branches -\u003e List branches in a GitHub repository, list_commits -\u003e Get list of commits of a branch in a GitHub repository., list_issue_types -\u003e List supported issue types for repository owner (organization)., list_issues -\u003e List issues in a GitHub repository., list_pull_requests -\u003e List pull requests in a GitHub repository., list_releases -\u003e List releases in a GitHub repository, list_tags -\u003e List git tags in a GitHub repository, merge_pull_request -\u003e Merge a pull request in a GitHub repository., pull_request_read -\u003e Get information on a specific pull request in GitHub repository., pull_request_review_write -\u003e Create and/or submit, delete review of a pull request.\n\nAvailable methods:\n- create: Create a new review of a pull request., push_files -\u003e Push multiple files to a GitHub repository in a single commit, request_copilot_review -\u003e Request a GitHub Copilot code review for a pull request., search_code -\u003e Fast and precise code search across ALL GitHub repositories using GitHub's native search engine., search_issues -\u003e Search for issues in GitHub repositories using issues search syntax already scoped to is:issue, search_pull_requests -\u003e Search for pull requests in GitHub repositories using issues search syntax already scoped to is:pr, search_repositories -\u003e Find GitHub repositories by name, description, readme, topics, or other metadata., search_users -\u003e Find GitHub users by username, real name, or other profile information., sub_issue_write -\u003e Add a sub-issue to a parent issue in a GitHub repository., update_pull_request -\u003e Update an existing pull request in a GitHub repository., update_pull_request_branch -\u003e Update the branch of a pull request with the latest changes from the base branch."
}
